#include <stdio.h>
#include <string.h>

int main(void)
{
	char buff[4] = {0};
	char appear[1024] = {0};
    gz_ret_cd_to_rsp_cd(buff, "000E1001", appear);
	printf("buff :%s, appear :%s\n", buff, appear);
    return 0;
}


int gz_ret_cd_to_rsp_cd(char *rsp_cd, char *ret_cd, char *appear_info)
{
    if (ret_cd == NULL || rsp_cd == NULL)
    {
		printf("****人行返回码和系统状态码不能为空****\n");
    }
    if (appear_info == NULL)
    {
		printf("****接受回执的地址为空，不显回执结果****\n");
    }
    struct
    {  
        char type[2];
        char *info;
	int info_num;
	struct code_info *codep;
    }
    type_info[] = 
    {  
        {"I1", "交易信息"},
        {"W1", "警告信息"},
        {"E1", "报文数据错"},
        {"E2", "帐户状态错"},
        {"E3", "系统状态错"},
        {"E4", "密押错"},
        {"E5", "权限错"},
        {"E6", "业务状态错"},
        {"E7", "文件错"},
        {"E9", "其他业务错"},
        {"S1", "操作系统错"},
        {"S2", "中间件错"},
        {"S3", "数据库错"},
        {"S9", "其他系统错"},
    };  
    struct code_info
    {  
        char code[3];
        char *info;
    };  
    struct code_info i1[] =
    {  
        {"", "交易成功"}
    };  
    struct code_info w1[] =
    {  
	{"001", "已登录"},
	{"002", "已退出"},
    };
    struct code_info e1[] =
    {  
	{"001", "单笔报文头版本号错误"},
	{"002", "单笔报文头发起时间错误"},
	{"003", "单笔报文头优先级错误"},
	{"004", "单笔报文头发起方系统号错误"},
	{"005", "单笔报文头发起地区代码错误"},
	{"006", "单笔报文头接收地区代码错误"},
	{"007", "单笔报文头报文编号错误"},
	{"008", "单笔报文头信息序号错误"},
	{"009", "单笔报文头原信息序号错误"},
	{"010", "单笔报文头编核押标志错误"},
	{"011", "批量交易文件头业务渠道错误"},
	{"012", "批量交易文件头发起文件名错"},
	{"013", "批量交易文件头原文件名错"},
	{"014", "批量交易文件头发起行行号错"},
	{"015", "批量交易文件头付款行清算行号错"},
	{"016", "批量交易文件头收款行清算行号错"},
	{"017", "批量交易文件头清算场次错"},
	{"018", "批量交易文件头交易货币错"},
	{"019", "批量交易文件头总笔数错"},
	{"021", "批量交易文件头总金额错"},
	{"022", "批量交易文件头返回码错"},
	{"023", "交易类型细分错误"},
	{"024", "委托日期错误"},
	{"025", "凭证提交号错误"},
	{"026", "交易货币错误"},
	{"027", "交易金额错误"},
	{"028", "发起行行号错误"},
	{"029", "付款行行号错误"},
	{"030", "付款人开户行行号错误"},
	{"031", "付款人账号错误"},
	{"032", "付款人名称错误"},
	{"033", "收款行行号错误"},
	{"034", "收款人开户行行号错误"},
	{"035", "收款人账号错误"},
	{"036", "收款人名称错误"},
	{"037", "付款人地址错误"},
	{"038", "收款人地址错误"},
	{"039", "付款人证件类型"},
	{"040", "付款人证件号码错误"},
	{"041", "付款人手机号码错误"},
	{"042", "付款人电子邮箱错误"},
	{"043", "业务渠道错误"},
	{"044", "业务种类错误"},
	{"045", "附言错误"},
	{"046", "业务标识错误"},
	{"047", "委托方代码错误"},
	{"048", "钞户/汇户标识错误"},
	{"049", "手续费方式错误"},
	{"050", "汇款信息错误"},
	{"051", "服务点输入方式码错误"},
	{"052", "现金/转账标识错误"},
	{"053", "对公/对私标识错误"},
	{"054", "卡/折标识错误"},
	{"055", "授权码错误"},
	{"056", "第二磁道数据错误"},
	{"057", "第三磁道数据错误"},
	{"058", "个人识别号（PIN）数据错误"},
	{"059", "税票号码错误"},
	{"060", "纳税人/缴费人编码错误"},
	{"061", "纳税人/缴费人名称错误"},
	{"062", "预算级次错误"},
	{"063", "预算科目错误"},
	{"064", "征收机关代码错误"},
	{"065", "税票限缴日期错误"},
	{"066", "国库代码错误"},
	{"067", "文件名称错误"},
	{"068", "查询缴费期错误"},
	{"069", "缴费标志错误"},
	{"070", "用户编号错误"},
	{"071", "账单明细错误"},
	{"072", "原财税接口错误"},
	{"073", "扣款标志错误"},
	{"074", "协议号错误"},
	{"075", "实扣金额错误"},
	{"076", "手续费错误"},
	{"077", "系统标志错误"},
	{"078", "冲账原因码错误"},
	{"079", "接收账户行错误"},
	{"080", "信息内容错误"},
	{"081", "账号错误"},
	{"082", "账户名称错误"},
	{"083", "用户名称错误"},
	{"084", "可用余额错误"},
	{"085", "账面余额错误"},
	{"086", "发票日期错误"},
	{"087", "发票明细错误"},
	{"088", "ETS信息类型错误"},
	{"089", "联系人名称错误"},
	{"090", "联系人地址错误"},
	{"091", "联系人地址编码错误"},
	{"092", "联系人电话错误"},
	{"093", "交易限额错误"},
	{"094", "绑定收款人标志错误"},
	{"095", "账户余额错误"},
	{"096", "轧差额错误"},
	{"097", "登陆识别码错误"},
	{"098", "新登陆识别码错误"},
	{"099", "原交易类型细分错误"},
	{"100", "原发起行行号错误"},
	{"101", "原委托日期错误"},
	{"102", "原凭证提交号错误"},
	{"103", "原交易货币错误"},
	{"104", "原交易金额错误"},
	{"105", "原协议号错误"},
	{"106", "原用户编号错误"},
	{"107", "中心受理号错误"},
	{"108", "清算日期错误"},
	{"109", "清算场次错误"},
	{"110", "回应行业务处理号错误"},
	{"111", "回应行交易受理时间错误"},
	{"112", "返回码错误"},
	{"113", "返回码附言说明错误"},
	{"114", "付款行业务处理号错误"},
	{"115", "付款行交易受理时间错误"},
	{"116", "收款行业务处理号错误"},
	{"117", "收款行交易受理时间错误"},
	{"999", "其他错误"},
    };
    struct code_info e2[] =
    {  
	{"001", "清算帐户余额不足"},
	{"002", "银行清算账户冻结/受限"},
	{"003", "银行清算账户未找到"},
	{"004", "审核不通过"},
    };
    struct code_info e3[] =
    {  
	{"001", "尚未登录系统 "},
	{"002", "在当前操作窗口，不接受本信息"},
	{"003", "因系统繁忙而延迟"},
	{"004", "发起行尚未进行业务登录"},
	{"005", "接收行尚未进行业务登录"},
	{"006", "接收行系统故障"},
    };
    struct code_info e4[] =
    {  
	{"001", "MAC鉴别失败"},
	{"002", "PIN格式出错"},
	{"003", "信息核押错误"},
	{"004", "密钥验证失败"},
    };
    struct code_info e5[] =
    {  
	{"001", "用户标识或口令错误"},
	{"002", "非法用户标识或登录类型"},
	{"003", "登录类型错误"},
	{"004", "不允许登录(权限错误)"},
	{"005", "口令有效使用期限已过"},
    };
    struct code_info e6[] =
    {  
	{"001", "查开户方原因"},
	{"002", "没收卡"},
	{"003", "不予承兑"},
	{"004", "无效交易"},
	{"005", "无效金额（发生额）"},
	{"006", "无效卡号 "},
	{"007", "无效应答"},
	{"008", "未能找到文件上记录"},
	{"009", "文件更新不成功"},
	{"010", "中心不支持的银行"},
	{"011", "受卡方与安全保密部门联系"},
	{"012", "输入的PIN次数超限"},
	{"013", "请求的功能尚不支持"},
	{"014", "已挂失卡"},
	{"015", "被窃卡"},
	{"016", "余额不足"},
	{"017", "无此账户"},
	{"018", "过期卡"},
	{"019", "密码错"},
	{"020", "不允许持卡人进行的交易"},
	{"021", "超出提款限额"},
	{"022", "原始金额不正确"},
	{"023", "超出取款次数限制"},
	{"024", "已挂失折"},
	{"025", "账户已冻结"},
	{"026", "已清户"},
	{"027", "原交易已被取消或冲正"},
	{"028", "账户被临时锁定"},
	{"029", "未登折行数超限"},
	{"030", "存折号码有误"},
	{"031", "当日存入的金额当日不能支取"},
	{"032", "日期切换正在处理"},
	{"033", "开户方或中心不能操作"},
	{"034", "重复交易"},
	{"035", "中心保密子系统失败"},
	{"036", "日期错"},
	{"037", "PIN格式出错"},
	{"038", "发卡方保密子系统失败"},
	{"039", "交易未按交易应出现次序出现"},
	{"040", "中心未就绪"},
	{"041", "开户方未就绪"},
	{"042", "原始交易不成功"},
	{"043", "系统忙，请稍后再提交"},
	{"044", "交易已被冲正"},
	{"045", "帐号错误"},
	{"046", "帐号户名不符"},
	{"047", "帐号货币不符"},
	{"048", "冲账金额错"},
	{"049", "无此原交易"},
	{"050", "存款金额低于最低起存金额"},
	{"051", "未到取款日"},
	{"052", "外币现金交易须输入现钞标志"},
	{"053", "无此储种"},
	{"054", "非定期账号"},
	{"055", "非活期账号"},
	{"056", "找不到原记录"},
	{"057", "货币错误"},
	{"058", "磁卡未生效"},
	{"059", "非通兑户"},
	{"060", "非外币户"},
	{"061", "账户已关户"},
	{"062", "金额错误"},
	{"063", "非存折户"},
	{"064", "交易金额小于该储种的最低支取金额"},
	{"065", "未签约"},
	{"066", "超时拒付"},
	{"067", "付款银行未入网"},
	{"068", "银行未开通该业务"},
	{"069", "收费单位未在中心登记"},
	{"070", "交易已清算，不能冲正"},
	{"099", "信息错误"},
    };
    struct code_info e7[] =
    {  
	{"001", "文件长度错误"},
	{"002", "文件重发"},
	{"003", "文件解压错误"},
	{"004", "文件名错误"},
	{"007", "原发文件不存在"},
	{"008", "原发文件已回应"},
	{"009", "文件不存在"},
	{"010", "文件名报文编号错误"},
	{"012", "文件名发起系统号错误"},
	{"013", "文件名委托日期错误"},
	{"014", "文件名批量包序号错误"},
    };
    struct code_info e9[] =
    {  
	{"", "其他业务错"},
    };
    struct code_info s1[] =
    {  
	{"", "操作系统错"},
    };
    struct code_info s2[] =
    {  
	{"001", "等待时间过长"},
	{"002", "通讯层信息的长度域不合法"},
	{"003", "通讯信息标识符错误"},
	{"004", "通讯信息格式错误"},
    };
    struct code_info s3[] =
    {  
	{"001", "数据库SELECT失败"},
	{"002", "数据库INSERT失败"},
	{"003", "数据库UPDATE失败"},
	{"004", "数据库DELETE失败"},
	{"005", "数据库CURSOR打开失败"},
	{"006", "数据库CURSOR FETCH失败"},
	{"007", "数据库CURSOR关闭失败"},
	{"008", "数据表中缺少重要的系统数据"},
	{"009", "关键字重复"},
	{"010", "数据库表不存在"},
	{"011", "数据库表空"},
	{"012", "数据库其它错误"},
    };
    struct code_info s9[] =
    {  
	{"", "其他系统错"},
    };
    /* 初始化后3位表示错误代码的数量 */
    type_info[0].info_num = sizeof(i1) / sizeof(*i1);
    type_info[1].info_num = sizeof(w1) / sizeof(*w1);
    type_info[2].info_num = sizeof(e1) / sizeof(*e1);
    type_info[3].info_num = sizeof(e2) / sizeof(*e2);
    type_info[4].info_num = sizeof(e3) / sizeof(*e3);
    type_info[5].info_num = sizeof(e4) / sizeof(*e4);
    type_info[6].info_num = sizeof(e5) / sizeof(*e5);
    type_info[7].info_num = sizeof(e6) / sizeof(*e6);
    type_info[8].info_num = sizeof(e7) / sizeof(*e7);
    type_info[9].info_num = sizeof(e9) / sizeof(*e9);
    type_info[10].info_num = sizeof(s1) / sizeof(*s1);
    type_info[11].info_num = sizeof(s2) / sizeof(*s2);
    type_info[12].info_num = sizeof(s3) / sizeof(*s3);
    type_info[13].info_num = sizeof(s9) / sizeof(*s9);
    type_info[0].codep = i1;
    type_info[1].codep = w1;
    type_info[2].codep = e1;
    type_info[3].codep = e2;
    type_info[4].codep = e3;
    type_info[5].codep = e4;
    type_info[6].codep = e5;
    type_info[7].codep = e6;
    type_info[8].codep = e7;
    type_info[9].codep = e9;
    type_info[10].codep = s1;
    type_info[11].codep = s2;
    type_info[12].codep = s3;
    type_info[13].codep = s9;
    int i, j;
	printf("ret_cd :%s\n", ret_cd);
	printf("type_info[i].type sizeof:%d\n", sizeof(type_info[i].type));
    for (i = 0; i < sizeof(type_info) / sizeof(*type_info); i++)
    {
	if (memcmp(ret_cd + 3, type_info[i].type, sizeof(type_info[i].type)) == 0) {
		if (appear_info != NULL) {
			memcpy(appear_info, type_info[i].info, strlen(type_info[i].info));
		}
	}
	for (j = 0; j < type_info[i].info_num; j++)
	{
	    if (memcmp(ret_cd + 5, type_info[i].codep[j].code, sizeof(type_info[i].codep[j].code)) == 0) {
		if (appear_info != NULL) {
		    sprintf(appear_info, "%s:%s", appear_info, type_info[i].codep[j].info);
		}
	        memcpy(rsp_cd, ret_cd + 5, 3);
		return 0;
	    }
	}
    }
    return -1;
}



